yerraabhilash/Embedded_Projects/STM32_PROJECTS/STM32CubeIDE/stm32f411xx_drivers/drivers/Src/stm32f411cexx_rcc_driver.c
/*
 * stm32f411cexx_rcc_driver.c
 *
 *  Created on: 26-Feb-2026
 *      Author: yerra
 */


#include "stm32f411cexx_rcc_driver.h"

uint16_t AHB_PreScaler[8] = {2,4,8,16,64,128,256,512};
uint16_t AHB1_PreScaler[4] = {2,4,8,16};





uint32_t RCC_GetPCLK1Value(void)
{
	//todo
	uint32_t pclk1, SystemClk;

	uint8_t clksrc, temp, ahbp, apb1p;

	clksrc = ((RCC->CFGR >> 2) & 0x3);

	if( clksrc == 0)
	{
		SystemClk = 16000000;
	}else if (clksrc == 1)
	{
		SystemClk = 8000000;
	}else if (clksrc == 2)
	{
		SystemClk = RCC_GetPLLOutputClk();
	}

	temp = ((RCC->CFGR >> 4 ) & 0xF);

	if(temp <8)
	{
		ahbp = 1;
	}
	else
	{
		ahbp = AHB_PreScaler[temp-8];
	}

	//apb1

	temp = ((RCC->CFGR >> 10 ) & 0x7);

	if(temp <8)
	{
		apb1p = 1;
	}else
	{
		apb1p = AHB1_PreScaler[temp-4];
	}

	pclk1 = (SystemClk / ahbp) / apb1p;


	return pclk1;
}

uint32_t RCC_GetPCLK2Value(void)
{
	//todo
	uint32_t pclk1, SystemClk;

	uint8_t clksrc, temp, ahbp, apb1p;

	clksrc = ((RCC->CFGR >> 2) & 0x3);

	if( clksrc == 0)
	{
		SystemClk = 16000000;
	}else if (clksrc == 1)
	{
		SystemClk = 8000000;
	}else if (clksrc == 2)
	{
		SystemClk = RCC_GetPLLOutputClk();
	}

	temp = ((RCC->CFGR >> 4 ) & 0xF);

	if(temp <8)
	{
		ahbp = 1;
	}
	else
	{
		ahbp = AHB_PreScaler[temp-8];
	}

	//apb1

	temp = ((RCC->CFGR >> 10 ) & 0x7);

	if(temp <8)
	{
		apb1p = 1;
	}else
	{
		apb1p = AHB1_PreScaler[temp-4];
	}

	pclk1 = (SystemClk / ahbp) / apb1p;


	return pclk1;
}

/*
 *
 uint32_t RCC_GetPLLOutputClk()
{
	//todo
	return 0;
}

*/
